//
//  Prefectures.swift
//  Task10App
//
//  Created by 山崎喜代志 on 2021/04/03.
//

import Foundation

struct Prefecture {
    var name: String

    static let prefectures: [Prefecture] = ["北海道", "青森県", "秋田県", "岩手県", "山形県", "宮城県", "福島県",
                                 "茨城県", "栃木県", "群馬県", "埼玉県", "千葉県", "東京都", "神奈川県",
                                 "山梨県", "新潟県", "富山県", "石川県", "福井県", "長野県", "岐阜県",
                                 "静岡県", "愛知県", "三重県", "和歌山県", "奈良県", "滋賀県", "京都府", "大阪府", "兵庫県",
                                 "岡山県", "広島県", "島根県", "山口県", "鳥取県",
                                 "愛媛県", "高知県", "徳島県", "香川県",
                                 "福岡県", "長崎県", "大分県", "宮崎県", "鹿児島県", "熊本県", "佐賀県", "沖縄県"]
        .map { Prefecture(name: $0) }
}
